app/views/shared/_user_info.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "microposts" WHERE ("microposts".user_id = 1)) AS subquery
---
    <span class="microposts">
      <%= pluralize(current_user.microposts.count, "micropost") %>