app/controllers/relationships_controller.rb

SELECT "relationships".* FROM "relationships" WHERE ("relationships".follower_id = 102) AND ("relationships"."followed_id" = 3) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 102) LIMIT 1
---
  def create
    @user = User.find(params[:relationship][:followed_id])

SELECT "relationships".* FROM "relationships" WHERE ("relationships".follower_id = 102) AND ("relationships"."followed_id" = 3) LIMIT 1
---
  def destroy
    @user = Relationship.find(params[:id]).followed