app/controllers/users_controller.rb

	def index
    @title = "All users"
    @users = User.paginate( :page => params[:page],:per_page => 15)
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM "users"

 	def show
    @user = User.find(params[:id])
     @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 4) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "microposts" WHERE ("microposts".user_id = 4)) AS subquery

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES ('f', '2012-04-28 14:21:29.949515', 'alexandra@gmail.com', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1', 'alexandra', NULL, '2012-04-28 14:21:29.949515')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "email" = 'user@example.org', "encrypted_password" = 'c8f8b724728a6d6684106e5e64e94ce811c9965d19dd44dd073cf86cf43bc238', "name" = 'New Name', "updated_at" = '2012-04-28 10:55:31.705220' WHERE ("users"."id" = 1)

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE ("users"."id" = 98)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 102) LIMIT 1